require 'set'
a = Set[1,1,2,3,4]     # => #<Set: {1, 2, 3, 4}>
b = Set.new([1,5])     # => #<Set: {1, 5}>
# 差集合・部分集合・上位集合
c = a-b                # => #<Set: {2, 3, 4}>
c.subset? a            # => true
a.superset? c          # => true
# ブロックの値によって分類したハッシュを求める
a.classify{|n| n % 2}  # => {1=>#<Set: {1, 3}>, 0=>#<Set: {2, 4}>}
# 積集合
a & b                  # => #<Set: {1}>
a.intersection b       # => #<Set: {1}>
# 和集合
a | b                  # => #<Set: {1, 2, 3, 4, 5}>
a.union b              # => #<Set: {1, 2, 3, 4, 5}>
a + b                  # => #<Set: {1, 2, 3, 4, 5}>
# 集合に新たな要素を加える
a << 10                # => #<Set: {1, 2, 3, 4, 10}>
a.add 20               # => #<Set: {1, 2, 3, 4, 10, 20}>
a                      # => #<Set: {1, 2, 3, 4, 10, 20}>
# 集合から要素を取り除く
a.delete 20            # => #<Set: {1, 2, 3, 4, 10}>
a                      # => #<Set: {1, 2, 3, 4, 10}>
