a = (1..6).to_a                   # => [1, 2, 3, 4, 5, 6]
# シャッフルはこんなに簡単に書ける。
a.shuffle                         # => [2, 4, 3, 6, 5, 1]
a.shuffle                         # => [6, 5, 1, 2, 4, 3]
a.shuffle                         # => [5, 1, 6, 2, 4, 3]
# Array#shuffle!は破壊的バージョン。
a.shuffle!                        # => [4, 2, 1, 3, 5, 6]
a                                 # => [4, 2, 1, 3, 5, 6]
# ランダムな要素を取り出す。Ruby 1.8.7ではchoiceメソッドを使う。
[ a.sample, a.sample, a.sample ]  # => [6, 2, 2]
# ランダムな要素を3つ取り出す。（Ruby 1.9以降）
a.sample(3)                       # => [3, 5, 6]
