# 簡単な多重代入
a, b = [1, 2]
[a, b]                          # => [1, 2]

a, b, c = [1, 2]
[a, b, c]                       # => [1, 2, nil]

a, b = [1, 2, 3]
[a, b]                          # => [1, 2]

a, = [1, 2]
a                               # => 1
a, * = [1, 2]
a                               # => 1

# splatつき多重代入
a, *rest = [1, 2, 3]
[a, rest]                       # => [1, [2, 3]]
a, b, *rest = [1, 2, 3]
[a, b, rest]                    # => [1, 2, [3]]
a, b, c, *rest = [1, 2, 3]
[a, b, c, rest]                 # => [1, 2, 3, []]

# ネストした配列の多重代入
a, (b, c) = [1, [2, 3]]
[a, b, c]                       # => [1, 2, 3]
(a, b), (c, d), e = [[1, 2], [3, 4], 5]
[a, b, c, d, e]                 # => [1, 2, 3, 4, 5]

a, (b, (c, *d)) = [1, [2, [3, 4, 5]]]
[a, b, c, d]                    # => [1, 2, 3, [4, 5]]

# 右辺に複数の式を書くこともできる
a, b = 1, 2
[a, b]                          # => [1, 2]
b, a = a, b
[a, b]                          # => [2, 1]
