require 'complex' # Ruby 1.9では多くの複素数のメソッドが組み込みになった
include Math
# 1+2iは3通りの表し方がある。Complex::Iは虚数単位の定数
# Numeric#imは数値に虚数単位を乗じた複素数で「x.im」を「xi」と置き換えて読んでほしい。
c1 = Complex(1, 2)            # => (1+2i)
1+2*Complex::I                # => (1+2i)
1+2.im                        # => (1+2i)
# 絶対値
c1.abs                        # => 2.23606797749979
# 共役複素数
c1.conj                       # => (1-2i)
# 極座標表示。絶対値1、偏角60度（π/3ラジアン）。
theta = PI/3                    # => 1.0471975511966
[cos(theta), sin(theta)]      # => [0.5, 0.866025403784439]
c2 = Complex.polar(1, theta)  # => (0.5+0.866025403784439i)
c2.polar                 # => [1.0, 1.0471975511966]
# 四則演算と累乗
c1+c2                         # => (1.5+2.86602540378444i)
c1-c2                         # => (0.5+1.13397459621556i)
c1*c2                         # => (-1.23205080756888+1.86602540378444i)
c1/c2                         # => (2.23205080756888+0.133974596215562i)
c1**5                       # => (41-38i)
c1**0.5                     # => (1.27201964951407+0.786151377757423i)
# iの定義「i = √-1」。
sqrt(-1)                      # => (0+1.0i)
# オイラーの公式「cosθ + i sinθ = e^{iθ}」。
cos(theta)+sin(theta).im      # => (0.5+0.866025403784439i)
exp(theta.im)                 # => (0.5+0.866025403784439i)
